-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Jun 11, 2014 at 03:44 PM
-- Server version: 5.5.24-log
-- PHP Version: 5.3.13

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `agri_web`
--

-- --------------------------------------------------------

--
-- Table structure for table `agri_org`
--

CREATE TABLE IF NOT EXISTS `agri_org` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(200) CHARACTER SET utf8 NOT NULL,
  `description` text CHARACTER SET utf8,
  `photo_dir` varchar(200) CHARACTER SET utf8 DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Table structure for table `agri_tools_info`
--

CREATE TABLE IF NOT EXISTS `agri_tools_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` text CHARACTER SET utf8 NOT NULL,
  `post` text CHARACTER SET utf8 NOT NULL,
  `photo_dir` varchar(200) CHARACTER SET utf8 DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=4 ;

--
-- Dumping data for table `agri_tools_info`
--

INSERT INTO `agri_tools_info` (`id`, `title`, `post`, `photo_dir`) VALUES
(1, 'ড্রাম সিডার', 'এটি প্লাস্টিকের তৈরি ছয়টি ড্রাম বিশিষ্ট বীজ বপন যন্ত্র। ড্রামগুলো ২.৩ মিটার প্রশস্ত লোহার দন্ডে পরপর সাজানো থাকে। লোহার দন্ডের দুপ্রান্তে প্লাস্টিকের তৈরি দুটি চাকা এবং যন্ত্রটি টানার জন্য একটি হাতল যুক্ত থকে। প্রতিটি ড্রামের দৈর্ঘ্য ২৫ সেন্টিমিটার এবং ব্যাস ৫৫ সেন্টিমিটার এবং এর দু’প্রান্তে ২০ সেন্টিমিটার দূরত্বে দুসারি ছিদ্র আছে। প্রয়োজনে রাবারের তৈরি সংযুক্ত বেল্টের সাহায্যে এক সারি ছিদ্র বন্ধ রাখা যায়। ব্রি ২০০৩ সালে বাংলাদেশে ড্রামসিডার প্রবর্তন করে। <br><br>\r\n\r\nআমন ২০০৪ মৌসুমে এবং বোরো ২০০৪ ও ২০০৫ মৌসুমে দেশের বিভিনড়ব অঞ্চলে কৃষকের মাঠে ড্রাম সিডার দিয়ে সরাসরি বোনা পদ্ধতিতে পরীক্ষা করে দেখা গেছে যে, ফলন গড়ে প্রায় ১৫% থেকে ২০% বেশি পাওয়া যায় এবং ধান ১০ থেকে ১২ দিন আগে কাটা যায়। ড্রাম সিডার পদ্ধতিতে আবাদ করলে রোপণের তুলনায় আমন মৌসুমে হেক্টর প্রতি প্রায় ৬,০০০ টাকা এবং বোরো মৌসুমে প্রায় ৮,০০০ টাকা অধিক মুনাফা অর্জন করা সম্ভব। <br><br>\r\n\r\nব্যবহারের সুবিধা<br>\r\n১। বাংলাদেশে আবাদি জমির পরিমাণ দ্রুত হ্রাস পাচ্ছে, যা বছরে প্রায় শতকরা এক ভাগ। এ অবস্থায় সীমিত জমিতে বাড়তি ফসলের জন্য হেক্টর প্রতি ফলন বাড়াতে হবে।<br>\r\n২। অকৃষি ক্ষেত্রে শ্রম বিনিয়োগের সুযোগ বৃদ্ধির ফলে কৃষিকাজের জন্য শ্রমিকের ঘাটতি দেখা দিচ্ছে। এর ফলে শ্রমিক মজুরি বেড়ে যাওয়ায় সনাতন পদ্ধতির ধান চাষ ব্যয়বহুল ও অলাভজনক হয়ে পড়ছে। ড্রাম সিডার যন্ত্রের সাহায্যে কাদা মাটিতে সরাসরি অঙ্কুরিত বীজ বপন একটি শ্রম-সাশ্রয়ী প্রযুক্তি, যার মাধ্যমে ধান চাষাবাদকে লাভজনক করা যেতে পারে।<br>\r\n৩। অধিকন্তু এ পদ্ধতিতে প্রচলিত রোপণের তুলনায় ধানের জীবনকাল প্রায় ১০-২০ দিন কমে যায় এবং ফলন প্রায় ১০-২০% বেশি হয়।<br>\r\n৪। ড্রাম সিডার দিয়ে বপন কৃষকের জন্য স্বাস্থ্যসম্মত একটি পদ্ধতি। কারণ এর ফলে কৃষককে কাদা-পানির মধ্যে কোমর বাঁকা করে অনেক সময় ধরে চারা রোপণ করতে হয় না।<br>\r\nউপসংহার<br>\r\n১) ড্রাম সিডার দিয়ে ধান চাষে আগাছাই প্রধান সমস্যা হতে পারে। তবে আগাছা খুবই এলাকা কেন্দ্রিক সমস্যা।<br>\r\n২) সাধারণত নিচু জমি এবং এক ফসলি জমিতে আগাছা কম হয়। যে জমিতে আগাছা কম হয় সেখানেই ড্রাম সিডার পদ্ধতি ব্যবহার করুন।<br>\r\n', 'images/tools_img/drum_seeder.jpg'),
(2, 'লিফ কালার চার্ট (এলসিসি)', 'লিফ কালার চার্ট (এলসিসি) প্লাস্টিকের তৈরি চার কোঠাবিশিষ্ট একটি সবুজ রঙের স্কেল। এ স্কেলে সবুজ রংএর বিভিন্ন গাঢ়ত্বের ৪ টি তালিকা রয়েছে যা দিয়ে ধানের সবুজ পাতার রংএর সামঞ্জস্য বিশ্লেষন করে জমিতে ইউরিয়া সারের প্রয়োগ মাত্রা নির্ধারন করা হয়।<br> <br>\r\n\r\nধান গাছের পাতার সবুজ রং এর গাঢ়ত্ব নির্ভর করে মুলত নাইট্রোজেনের উপর।গাছ যদি মাটি থেকে প্রয়োজনীয় নাইট্রোজেন না পায় তাহলে গাছের পাতার রং হলুদাভ হয়ে যায়।এ কারনে জমিতে নাইট্রোজেন যোগান দিতে ইউরিয়া সার প্রয়োগ করা হয়। এলসিসি স্কেলের মাধ্যমে ধানের সবুজ পাতার গাঢ়ত্ব নির্ণয় করে জমিতে চাহিদা অনুযায়ী ইউরিয়া সার ব্যবহার করা হলে সঠিকভাবে জমিতে নাইট্রোজেন পুস্টি উপাদান যোগ হয়। এলসিসির সঠিক ব্যবহারের মাধ্যমে ইউরিয়া অপচয় বহুলাংশে হ্রাস করা যায় এবং ফলনও বাড়ে অধিক হারে।', 'images/tools_img/lcc.jpg'),
(3, 'সবুজ সার', 'সাধারণত জমিতে কোন শস্য বপন করে তা সবুজ অবস্থায়ই আবার সে জমিতে মিশিয়ে দিয়ে যে সার তৈরী করা হয় উহাকে সবুজ সার বলে। এ সার নানা ভাবে মাটির উর্বরতা বাড়াতে সহায়তা করে। \r\nএ সার তৈরী করার আসল উদ্দেশ্য হল মাটিতে জৈব পদার্থ যোগ করা। যে সকল গাছের শিকড় মাটির গভীরে ছড়িয়ে যায়, অল্প পরিচর্যায় দ্রুত বেড়ে উঠে এবং অধিক পরিমাণে জৈব পদার্থ উৎপাদন করে সবুজ সার তৈরীতে ঐ সকল গাছ বেছে নেওয়া উচিত। গাছ জমিতে জন্মাবার পর যখন তাতে ফুল ধরা শুরু হয় তখনই তা চাষ দিয়ে মাটির সাথে মিশিয়ে দেওয়া হয়। বৃষ্টির পানিতে তা আস্তে আস্তে পচতে থাকে। পরবর্তী সময়ে কয়েকবার চাষ ও মই দিয়ে মাটি ওলট পালট করে দিলে গাছের বাকী অংশ আরো ভালভাবে মাটির নীচে পড়ে এবং পচে মাটির সঙ্গে মিশে যেয়ে মাটির উর্বরতা বৃদ্ধি করে এবং বুনট উন্নত করে। \r\nশিম্বীজাতীয় গাছ ধইঞ্চা, শন এবং মটরশুটি সাধারণত আমাদের দেশে সবুজ সার প্রস্তুত করার জন্য ব্যবহার করা হয়। শুটি জাতীয় বিধায় এ ফসল জমিতে শুধু জৈব পদার্থই যোগ করে না, উদ্ভিদের অতি প্রয়োজনীয় খাদ্যপাদান নাইট্রোজেনও যোগ করে থাকে। এ জাতীয় গাছের শিকড়ে এক রকম গুটি বা অর্বুদের সৃষ্টি হয়। তাতে মিথোজীবী ব্যাকটেরিয়া বাস করে এবং বায়ুমন্ডলের নাইট্রোজেন সংগ্রহ করে। জীবাণুদেহের এ নাইট্রোজেন পরবর্তী সময়ে মাটিতে সঞ্চিত হয়ে ফসলের গ্রহণোপযোগী হয়। কখনো কখনো কাউপি বা বরবটি এই কাজে ব্যবহৃত হয়। অ-শিম্বীজাতীয় গাছের মধ্যে রাই, সরগম, ভূট্টা প্রভৃতি অন্যান্য দেশে সবুজ সারের জন্য চাষ করা হয়। ', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `area_info`
--

CREATE TABLE IF NOT EXISTS `area_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `district_eng` varchar(100) DEFAULT NULL,
  `district` varchar(50) DEFAULT NULL,
  `agri_zone` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `land` text,
  `avg_produce` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `max_produce` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `min_produce` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `crops` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `soil_type` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `fertile_class` text,
  `irrigation_process` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `avg_rain` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `avg_temp` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `avg_max_temp` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `avg_min_temp` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `avg_hum` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=65 ;

--
-- Dumping data for table `area_info`
--

INSERT INTO `area_info` (`id`, `district_eng`, `district`, `agri_zone`, `land`, `avg_produce`, `max_produce`, `min_produce`, `crops`, `soil_type`, `fertile_class`, `irrigation_process`, `avg_rain`, `avg_temp`, `avg_max_temp`, `avg_min_temp`, `avg_hum`) VALUES
(1, 'Dhaka', 'ঢাকা', 'AEZ-15, আরিওল বিল', '৫৩৩৩৬৬.৭৭', '১৯০.৭৮', 'ধান', 'ভূট্টা', 'ধান,গম ভূট্টা, আখ,সবজি,ডাল, পাট,পিঁয়াজ,রসুন', 'উর্বর', 'নাইট্রোজেন-নিম্ন,ফসফরাস-নিম্ন, পটাশিয়াম-মধ্যম,গন্ধক-মধ্যম', 'টিউবওয়েল, নদী, খাল', '৩৭', '২৮', '৩৭', '২২', '৮৩'),
(2, 'Panchogar', 'পঞ্চগড়', 'রাজশাহী', '১২৩৬৫', '১২৫৬৯৮৭৪', 'ধান', 'গম', 'ধান, গম', 'উর্বর', 'উর্বর শ্রেণী', '', '৩৫', '', '', '', ''),
(3, 'Thakurgaon', 'ঠাকুরগাঁও', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(4, 'Nilphamari', 'নীলফামারি', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(5, 'Dinajpur', 'দিনাজপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(6, 'Rangpur', 'রংপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(7, 'Kurigram', 'কুড়িগ্রাম', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(8, 'Lalmonirhat', 'লালমনিরহাট', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(9, 'Gaibandha', 'গাইবান্ধা', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(10, 'Joypurhat', 'জয়পুরহাট', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(11, 'Naogaon', 'নঁওগা', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(12, 'Bogra', 'বগুড়া', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(13, 'Jamalpur', 'জামালপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(14, 'Sherpur', 'শেরপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(15, 'Nawabganj', 'নবাবগঞ্জ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(16, 'Rajshahi', 'রাজশাহী', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(17, 'Natore', 'নাটোর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(18, 'Sirajganj', 'সিরাজগঞ্জ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(19, 'Tangail', 'টাঙ্গাইল', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(20, 'Mymensingh', 'ময়মনসিংহ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(21, 'Netrokona', 'নেত্রকোনা', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(22, 'Sunamganj', 'সুনামগঞ্জ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(23, 'Sylhet', 'সিলেট', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(24, 'MBazar', 'মৌলভীবাজার', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(25, 'Hobiganj', 'হবিগঞ্জ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(26, 'Kishoreganj', 'কিশোরগঞ্জ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(27, 'Gazipur', 'গাজীপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(28, 'Kushtia', 'কুষ্টিয়া', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(29, 'Pabna', 'পাবনা', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1'),
(30, 'Manikganj', 'মানিকগঞ্জ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(31, 'NGanj', 'নারায়ণগঞ্জ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(32, 'Narsingdi', 'নরসিংদী', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(33, 'BBaria', 'ব্রাক্ষ্মনবাড়িয়া', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(34, 'Comilla', 'কুমিল্লা', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(35, 'Chadpur', 'চাঁদপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(36, 'Shariatpur', 'শরীয়তপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(37, 'Madaripur', 'মাদারীপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(38, 'Munshiganj', 'মুন্সীগঞ্জ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(39, 'Faridpur', 'ফরিদপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(40, 'Gopalganj', 'গোপালগঞ্জ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(41, 'Magura', 'মাগুরা', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(42, 'Jhenaidah', 'ঝিনাইদহ্‌', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(43, 'Chuadanga', 'চুয়াডাঙ্গা', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(44, 'Meherpur', 'মেহেরপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(45, 'Jessore', 'যশোর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(46, 'Narail', 'নড়াইল', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(47, 'Satkhira', 'সাতক্ষীরা', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(48, 'Khulna', 'খুলনা', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(49, 'Bagerhat', 'বাগেরহাট', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(50, 'Pirojpur', 'পিরোজপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(51, 'Jhalokathi', 'ঝালকাঠি', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(52, 'Barguna', 'বরগুনা', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(53, 'Patuakhali', 'পটুয়াখালী', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(54, 'Barisal', 'বরিশাল', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(55, 'Vola', 'ভোলা', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(56, 'Laxmipur', 'লক্ষীপুর', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(57, 'Noakhali', 'নোয়াখালি', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(58, 'Feni', 'ফেনী', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(59, 'Chittagong', 'চট্রগ্রাম', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(60, 'Khagrachari', 'খাগরাছড়ি', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(61, 'Rangamati', 'রাঙ্গামাটি', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(62, 'Bandorban', 'বান্দরবান', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(63, 'CoxBazar', 'কক্সবাজার', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL),
(64, 'Rajbari', 'রাজবাড়ী', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE IF NOT EXISTS `categories` (
  `category_id` int(11) NOT NULL AUTO_INCREMENT,
  `category` varchar(150) CHARACTER SET utf8 NOT NULL,
  PRIMARY KEY (`category_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=8 ;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`category_id`, `category`) VALUES
(1, 'দানা ফসল'),
(2, 'ডাল ফসল'),
(3, 'তেল ফসল'),
(4, 'অর্থকরী ফসল'),
(5, 'ফল'),
(6, 'শাক-সবজি'),
(7, 'মশলা');

-- --------------------------------------------------------

--
-- Table structure for table `crop_category`
--

CREATE TABLE IF NOT EXISTS `crop_category` (
  `crop_id` int(11) NOT NULL AUTO_INCREMENT,
  `category_id` int(11) DEFAULT NULL,
  `crop_name` varchar(150) CHARACTER SET utf8 NOT NULL,
  PRIMARY KEY (`crop_id`),
  KEY `category_id` (`category_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=5 ;

--
-- Dumping data for table `crop_category`
--

INSERT INTO `crop_category` (`crop_id`, `category_id`, `crop_name`) VALUES
(1, 1, 'ধান'),
(2, 1, 'গম'),
(3, 2, 'মসুর'),
(4, 2, 'খেসারি');

-- --------------------------------------------------------

--
-- Table structure for table `crop_info_bank`
--

CREATE TABLE IF NOT EXISTS `crop_info_bank` (
  `category_id` int(11) NOT NULL,
  `crop_id` int(11) NOT NULL,
  `cultivation_process` text,
  `irrigation_process` text,
  `fertilizer_process` text,
  `disease_manage` text,
  `insects_manage` text,
  `harvest_collection` text,
  `seed_manage` text,
  `soil_land_select` text,
  `interim_caring` text,
  `store_date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `crop_info_bank`
--

INSERT INTO `crop_info_bank` (`category_id`, `crop_id`, `cultivation_process`, `irrigation_process`, `fertilizer_process`, `disease_manage`, `insects_manage`, `harvest_collection`, `seed_manage`, `soil_land_select`, `interim_caring`, `store_date`) VALUES
(1, 1, 'ধানের জাতসমূহ : বাংলাদেশে তিন জাতের ধান আছে।<br />যথা :<br />ক) স্থানীয় জাত : টেপি, গিরবি, দুধসর, রতিশাইল<br />খ) স্থানীয় উন্নতজাত : কটকতারা, কালিজিরা, হাসিকলমি, নাইজার শাইল, রতিশাইল, বিনাশাইল ইত্যাদি।<br />গ) উচ্চফলশীল (উফশী) জাত : বাংলাদেশে অনেক জমিতে উফশী (উচ্চ ফলনশীল) ধানের চাষ করা হয়ে থাকে।<br />উফশী ধানের জাতগুলোর সাধারণ কতগুলো বৈশিষ্ট্য থাকে। যেমন :<br />১) গাছ মজবুত এবং পাতা খাড়া।<br />২) শীষের ধান পেকে গেলেও গাছ সবুজ থাকে।<br />৩) গাছ খাটো ও হেলে পড়ে না।<br />৪) খড়ের চেয়ে ধানের উৎপাদন বেশি।<br />৫) পোকা ও রোগের আক্রমণ কম হয়।<br />৬) অধিক কুশি গজায়।<br />৭) সার গ্রহণক্ষমতা অধিক এবং ফলন বেশি।<br /><br /><br />উফশী ধানে যখন প্রয়োজনীয় বিশেষ গুণাগুণ, যেমন- রোগবালাই সহনশীলতা, স্বল্প জীবনকাল, চিকন চাল, খরা,<br />লবণাক্ততা ও জলমগড়বতা সহিষ্ণু ইত্যাদি সংযোজিত হয়, তখন তাকে আধুনিক ধান বলে। তাই সকল উফশী ধান আধুনিক নয়, কিন্তু সকল আধুনিক ধানে উফশী গুণ বিদ্যমান।<br />বাংলাদেশে ধান গবেষণা ইনস্টিটিউট (ব্রি) বিভিন্ন পদ্ধতি অবলম্বন করে এ পর্যন্ত ধানের উফশী ৫৬টি জাত উদ্ভাবন করেছে। ধানের মৌসুম তিনটি। যথা- আউশ, আমন ও বোরো। ধানের কতকগুলো ব্রি অনুমোদিত জাত আছে যেগুলো আউশ ও বোরো দুই মৌসুমেই চাষ করা যায়। যেমন- বিআর ১ (চান্দিনা), বি আর ২(মালা), বিআর ৯(সুফলা),বিআর ১৪(গাজী)। আবার বিআর ১, বিআর ২ জাতগুলো আমন মৌসুমেও চাষ করা হয়। নিম্নে তিন মৌসুমের অনুমোদিত জাতগুলোর সংখ্যা ও কিছু জাতের নাম উল্লেখ করা হলো :<br /><br /><br />ক) আউশ মৌসুমের জাত : শুধু আউশ মৌসুমেই চাষ করা হয় এরূপ জাত হলো ৮টি। এদের মধ্যে কয়টি বিআর ২০(নিজামী), বিআর ২১ (নিয়ামত) ইত্যাদি। এ জাতগুলো আউশ মৌসুমে বপন ও রোপণ দু’ভাবেই আবাদ করা যায়।এ মৌসুমে বীজ বপনের উপযুক্ত সময় ১৫-৩০ চৈত্র এবং চারা রোপনের জন্য চারার বয়স হবে ২০-২৫ দিন।<br /><br /><br />খ) আমন মৌসুমের জাত : শুধু আমন মৌসুমেই চাষ করা হয় এরূপ জাত হলো ২৫টি। এদের কয়েকটি হলো বিআর৫(দুলাভোগ), বিআর ১১(মুক্তা), বিআর ২২(কিরণ), ব্রি ধান ৫৬, ব্রি ধান ৫৭ ইত্যাদি।<br />সবগুলো জাতই রোপণ পদ্ধতিতে চাষ করা হয় এবং রোপণের জন্য চারার বয়স হতে হবে ২৫-৩০ দিন।<br /><br /><br />গ) বোরো মৌসুমের জাত : শুধু বোরো মৌসুমেই চাষ করা যায় এরূপ জাত হলো ১৩টি। এদের কয়েকটি হলো<br />বিআর ১৮(শাহজালাল), ব্রি ধান ২৮, ব্রি ধান ৩৬, ব্রি ধান ৪৫, ব্রি ধান ৫০ (বাংলামতি), ব্রি হাইব্রিড ১, ব্রি<br />হাইব্রিড ২ এবং ব্রি হাইব্রিড ৩ ইত্যাদি। রোপণের জন্য চারার বয়স হতে হবে ৩৫-৪৫ দিন।<br /><br /><br />এ ছাড়া ধান ফসলের আরও কিছু জাত আছে। যেমন : বৃষ্টিবহুল, খরা-সহিষ্ণু, লবণাক্ততা-সহিষ্ণু, হাওর ,ঠাণ্ডা-সহিষ্ণু জাত ইত্যাদি।', 'চারা রোপনের পর জমিতে পানি কম রাখতে হবে যেন চারা তলিয়ে না যায়। ধানের জমিতে সব সময় গভীর পানি ধরে রাখার প্রয়োজন নেই। তার চেয়ে একটি পূর্ণ মাত্রায় সেচ দেওয়ার পর পরবর্তী সেচ দেওয়ার আগে জমি তিন দিন শুকনো রাখলে ধানের ফলন তেমন কমবে না উপরন্তু পানির পরিমণি ২৫-৩০ ভাগ কম লাগবে। গভীর নলকূপ এলাকায় এই পদ্ধতিতে প্রায় ৪০ ভাগ জমির পরিমাণ একই পরিমাণ পানি দিয়ে চাষাবাদ বাড়ানো সম্ভব। এ পদ্ধতিতে আগাছার পরিমাণ বেশি হলে আগাছানাশক প্রয়োগ করা লাভজনক। ধান গাছে কাইচ থোড় আসার আগ পর্যন্ত এই পদ্ধতিতে পানি সেচ দেওয়া যায়। তবে কাইচথোড় আসা শুরু করলে ৫-৭ সেন্টিমিটার পানি থাকলে ভাল হয়। এছাড়াও আমন ধান কাটার পর জমি পতিত না রেখে একটা বা দুটো চাষ দিয়ে ফেলে রাখলে বোরো মৌসুমে জমি তৈরিতে শতকরা ২০ ভাগ পানি কম লাগবে। কারণ পতিত জমিতে ফাটল ধরলে জমি তৈরির সময় ফাটল দিয়ে প্রচুর পরিমাণ পানির অপচয় হয়।<br />সার প্রয়োগের আগে জমি থেকে পানি কমিয়ে উপরি প্রয়োগ করতে হয় এবং ২-৩ দিন পর আবার পানি দিলে সারের কার্য়কারিতা বৃদ্ধি পায়। জমিতে পানি ধরে রাখলে দানাদার কীটনাশকের গুণাগুণ বাড়ে। ধান পাকার সময় দানা শক্ত হওয়া শুরু হলেই জমি থেকে পানি সরিয়ে দিতে হয়। আউশ ও আমন মৌসুমে বৃষ্টির পানির সাহায্যে ভালভাবেই  উফশী ধানের চাষ করা যায়। বৃষ্টির পানি ব্যবহার করে চাষ করতে হলে ক্ষেতে পানি ধরে রাখার জন্য আইল ১৫ সেন্টিমিটার উঁচু করে বেঁধে দিতে হবে।<br /><br /> <br />সেচের পানির অপচয় রোধ:<br /> <br /> এ অপচয় রোধকল্পে পিভিসি অথবা প্লাস্টিক পাইপ ব্যবহার করা যায়। এ পদ্ধতিতে সেচ দিলে পানির অপচয় বন্ধের সাথে সাথে সেচ খরচও কমানো যায় কারণ এ অবস্থায় গভীর নলক্থ্থপ থেকে কাঁচা নালার সেচের তুলনায় শতকরা ৪২ ভাগ বেশী জমিতে সেচ দেওয়া সম্ভব। তাছাড়া অঙ্কুরিত বোনা ধানের চাষ করে পানির কার্যক্ষমতা শতকরা ২৯ ভাগ বৃদ্ধি করা সম্ভব।<br /> <br />সম্পূরক সেচ:<br /> <br />বৃষ্টি নির্ভর ধান চাষে খরা মোকাবেলা করার জন্য সম্পূরক সেচ দিতে হবে। গবেষণায় দেখা গেছে, দুবারে ১৫২ মিলিমিটার সম্পূরক সেচ দিয়ে শতকরা ৪০-৫০ ভাগ ফলন বাড়ানো যায়। বৃষ্টি-নির্ভর খরা কবলিত ধানের চেয়ে সম্পূরক সেচযুক্ত ধানের ফলন হেক্টরে প্রায় ১ টন বেশী হয়। অগভীর কিংবা গভীর নলক্থপ ছাড়াও পুকুর পদ্ধতিতে খরা মোকাবেলা করা যায়। এ জন্য ধানি জমির আয়তনের শতকরা ৫ ভাগ জায়গায় ২ মিটার গভীর করে পুকার কেটে নিতে হবে। এ ছোট পুকুরে যে পরিমাণ পানি ধরে রাখা যাবে তা দিয়ে খরার সময় রোপা আমন ধানকে রক্ষা করা যায়। উপরন্তু ছোট পুকুরে মাছ চাষও করা যায়।', 'সুষম মাত্রায় সার ব্যবহার ফসল, মাটি এবং পরিবেশের জন্য ভাল। এজন্য প্রথমে জানতে হবে কৃষি পরিবেশ অঞ্চল ভিত্তিক মাটির উর্বরতা শ্রেণী ( সারণী ৩) এবং জেনে নিতে হবে জমি কোন কৃষি পরিবেশ অঞ্চলের অন্তর্ভুক্ত। সে অনুযায়ী সারণী ৪-এ মৌসুম-ভিত্তিক সারের সুষম মাত্রার সুপারিশ দেওয়া আছে।<br /><br />ফসফেট, পটাশ, জিপসাম ও দস্তা সারের প্রভাব পরবর্তী ফসল পর্যন্ত থাকে। এ জন্য রবি ফসলে ফসফেট, পটাশ ও জিপসাম সার সারণী ৪ মোতাবেক ব্যবহার করলে দ্বিতীয় ফসলে উল্লিখিত সারগুলোরে মাত্রা অর্ধেক পরিমাণ ব্যবহার করতে হবে। দস্তা সার একবার প্রয়োগ করলে তা পরের তিন ফসলে প্রয়োগ করতে হবে না। সারণী ৫-এ জাত ও মৌসুম ভিত্তিক ইউরিয়া উপরি-প্রয়োগের সময় ও কিস্তি উল্লেখ করা হয়েছে।<br /><br />ইউরিয়া সারের কার্যকারিতা জমিতে কম সময় থাকে তাই এ সার কিস্তিতে প্রয়োগ করতে হবে। ১ম কিস্তি জমি তৈরির শেষ পর্যায়ে, ২য় কিস্তি ধানের গোছায় ৪-৫টি কুশি অবস্থায় ও ৩য় কিস্তি কাইচথোড় আসার ৫-৭ পূর্বে দিতে হবে। যে সব জাতের জীবণকাল ১৫০ দিনের বেশি সেক্ষেত্রে জমি তৈরির সময় ইউরিয়া প্রথম কিস্তি এবং পরে সমান তিন কিস্তিতে উপরিপ্রয়োগ করতে হবে।<br /><br />ইউরিয়া উপরি-প্রয়োগের সময় মাটিতে অবশ্যই প্রচুর রস থাকতে হবে। সবচাইতে ভাল হয় যদি ক্ষেতে ২-৩ সেন্টিমিটার পানি থাকে। ইউরিয়া প্রয়োগের সাথে সাথে হাতে বা উইডার দিয়ে আগাছা পরিস্কার করা দরকার।<br /><br />ইউরিয়া সার প্রয়োগের পরেও ধানগাছ যদি হলদে থাকে এবং বাড়বাড়তি কম হয় তাহলে  গন্ধকের অভাব হয়েছে ধরে নেওয়া যায়। সে ক্ষেত্রে তাৎক্ষণিক পদক্ষেপ হিসেবে জমি থেকে পানি সরিয়ে দিতে হবে। এরপর হেক্টরপ্রতি ৬০ কেজি বা বিঘাপ্রতি ৮ কেজি জিপসাম সার উপরি-প্রয়োগ করলে ফল পাওয়া যাবে।<br /><br />যদি ধানগাছ মাঝেমধ্যে খাটো হয়ে বসে যায় এবং পুরাতন পাতায় মরচে পড়া বাদামী  থেকে কমলা রঙ ধারণ করে এবং ধানের কুশি কম থাকে তখন ধরে নিতে হবে  দস্তার অভাব হয়েছে। এ ক্ষেত্রে  জমি থেকে পানি সরিয়ে দিতে হবে। এরপর হেক্টরপ্রতি ১০ কেজি বা বিঘাপ্রতি ১ কেজি ৩৫০ গ্রাম দস্তা সার উপরি-প্রয়োগ করতে হবে। অন্যথায় হেক্টরপ্রতি ২.৫-৩.০ কেজি জিংক সালফেট ১২৫-১৫০ গ্যালন পরিস্কার পানির সাথে মিশিয়ে স্প্রে মেশিনের সাহায্যে দু’কিস্তিতে যথাক্রমে রোপণের ১০-১৫ ও ৩০-৩৫ দিন পর ধানগাছের পাতার উপর ছিটিয়ে দিলে ভাল ফল পাওয়া যায়। এভাবে মূল্যবান দস্তা সারের অপচয় রোধ করা সম্ভব।', 'ব্রি উদ্ভাবিত উফশী ধান কোন কোন রোগবালাই প্রতিরোধ করতে পারে তা সারণী ৮-এ দেখানো হয়েছে। উফশী ধানগাছে প্রধান প্রধান যে সমস্ত রোগ হতে পারে তাদের বিবরণ নিচে দেয়া হলো।<br /><br />টুংরো:<br />টুংরো একটি ভাইরাসজনিত রোগ। সবুজ পাতাফড়িং নামক পোকা এ রোগের বাহক। চারা অবস্থা থেকে গাছে ফুল আসা পর্যন্ত যে কোন অবস্থায় এ রোগ দেখা দিতে পারে। যত কম বয়সে এ রোগের আক্রমণ হয় ক্ষতির পরিমাণও তত বেশি হয়। প্রথমে কচি পাতায় লম্বালম্বি শিরা বরাবর পর্যায়ক্রমে হালকা সবুজ ও হালকা হলদে রেখা দেখা যায়। পরে ক্রমান্বয়ে ৭ থেকে ১০ দিনের মধ্যে সমস্ত পাতাটা উপর দিক থেকে গাঢ় হলদে রঙের হয় এবং আক্রান্ত পাতা একটু মুচড়ে যায়। গাছের বাড়-বাড়তি ও কুশি গজানো কমে যায়। ফলে আক্রান্ত গাছ সুস্থ গাছের তুলনায় খাটো দেখায়। প্রথম দিকে বিক্ষিপ্তভাবে দু’একটি গোছায় রোগটি দেখা যায় এবং পরে আশেপাশের গোছায় ছড়িয়ে পড়ে।<br /><br />ধানগাছ হলদে হলেই টুংরো হয়েছে বলে মনে করা সঙ্গত নয়। কারণ ক্ষেতে নাইট্রোজেন অথবা সালফারএর অভাবজনিত অপুষ্টি, পচা পানি জমে থাকা, পানির অভাব, শীতের প্রকোপ, লোহার আধিক্য ও লবণাক্ততার কারণেও ধানগাছ হলদে হয়ে যায়। তবে এ সব ক্ষেত্রে জমির শতকরা ১০০ ভাগ গাছেই সমভাবে লক্ষণ প্রকাশ পায়। কিন্তু টুংরো হলে বিক্ষিপ্তভাবে এর লক্ষণ দেখা যায়। এ রোগের ব্যবস্থাপনা নিম্নরূপ-<br /><br />ক) রোগের উৎস, যেমন আড়ালী ঘাস, বাওয়া ধান এবং রোগাক্রান্ত গাছ দেখামাত্রই তুলে ধ্বংস করুন।<br />খ) আলোক-ফাঁদ ব্যবহার করে বাহক পোকা সবুজ পাতাফড়িং মেরে ফেলুন।<br />গ) হাতজালের প্রতি টানে গড়ে একটি সবুজ পতাফড়িং বা ক্ষেতে  টুংরো রোগাক্রান্ত ধানগাছ দেখা গেলে বীজতলায় বা জমিতে উপযুক্ত কীটনাশক প্রয়োগ করুন (সারণী ৯)।<br /><br />পাতা পোড়া:<br />এটি একটি ব্যক্টেরিয়াজনিত রোগ। চারা অবস্থায় পাতাপোড়া রোগ হলে সম্পূর্ণ গোছা পচে যায় ও ঢলে পড়ে। রোগের এ অবস্থাকে কৃসেক বলে। রোগে আক্রান্ত কান্ড ছিঁড়ে চাপ দিলে পুঁজের মতো আঁঠালো ও দুর্গন্ধযুক্ত রস বের হয়। তাছাড়া কখনও কখনও রোগাক্রান্ত গাছের উপর দিকের কচিপাতা ফ্যাকাশে হলদে রঙ ধারণ করে আস্তে আস্তে মরে যায়।<br />বয়স্ক গাছে থোড় অবস্থা থেকে এ রোগের লক্ষণ দেখা যায়। প্রথমে পাতার অগ্রভাগ বা কিনারা থেকে লক্ষণ শুরু হয়। আক্রান্ত অংশ থেকে পাতার দুই বা এক ধার থেকে পাতাটা শুকনো খড়ের রঙ ধারণ করে এবং ক্রমশ সম্পূর্ণ পাতাটাই মরে শুকিয়ে যায়। পোকার আক্রমণ বা বাতাসে পাতায় পাতায় ঘর্ষণের ফলে সৃষ্ট ক্ষত দিয়ে রোগটির জীবাণু পাতার ভিতরে ডুকে পড়ে। অনকুল অবস্থায় ২-৩ দিনের মধ্যেই এ রোগ সারা মাঠে ছড়িয়ে পড়তে পারে। ব্যবস্থাপনার জন্য-  <br /><br />ক) সুষম মাত্রায় সার ব্যবহার করুন এবং ইউরিয়া সার তিন কিস্তিতে প্রয়োগ করুন।<br />খ) ঝড়-বৃষ্টি এবং রোগ দেখা দেয়ার পর ইউরিয়া সারের উপরি-প্রয়োগ বন্ধ রাখুন।<br />গ) কৃসেক হলে আক্রান্ত জমির পানি শুকিয়ে ৭-১০ দিন পর আবার সেচ দিন।<br />ঘ) রোগাক্রান্ত জমির ফসল কাটার পর নাড়া পুড়িয়ে ফেলুন।<br /><br />উফরা:<br />এটি ধানের কৃমিজনিত রোগ। এক প্রকার ক্ষুদ্র কৃমি ধানগাছের কচি পাতা ও খোলের সংযোগস্থলে আক্রমণ করে। কৃমি গাছ থেকে রস শোষণ করায় প্রথমে পাতার গোড়ায় সাদা ছিটে-ফোঁটা দাগ দেখা যায়। সাদা দাগ ক্রমে বাদামি রঙের হয়ে যায় এবং পরে পুরো আগাটাই শুকিয়ে মরে যায়। আক্রমণের প্রকোপ বেশি হলে গাছের বাড়-বাড়তি কম হয়। থোড় অবস্থায় আক্রমণ করলে থোড়ের মধ্যে শিষ মোচড়ানো অবস্থায় দেখা যায়। ফলে কোন শিষ বের হতে পারে না। উফরা রোগের কৃমি পরিত্যক্ত নাড়া, খড়কুটো, ঘাস এমনকি মাটিতে কুন্ডলী পাকানো অবস্থায় বেঁচে থাকতে পারে। ব্যবস্থাপনার জন্য-<br />ক) রোগাক্রান্ত জমির ফসল কাটার পর নাড়া পুড়িয়ে ফেলুন।<br />খ) সম্ভব হলে বৃষ্টির পর জমি চাষ দিয়ে ১৫-২০ দিন ফেলে রাখুন।<br />গ) আক্রান্ত জমিতে বীজতলা করবেন না।<br />ঘ) রোগ দেখা দিলে হেক্টরপ্রতি ২০ কেজি ফুরাডান ৫জি অথবা কিউরেটার ৫জি প্রয়োগ করুন।<br />ঙ) ধানের পর অন্যান্য ফসল চাষ করুন।<br /><br />ব্লাষ্ট:<br />ব্লাষ্ট একটি ছত্রাকজনিত রোগ। রোগটি ধানগাছের চারা অবস্থা থেকে শুরু করে ধান পাকা পর্যন্ত যে কোন সময়ে হতে পারে। এ রোগে ধানগাছের পাতা, গিঁট ও শিষের গোড়া আক্রান্ত হয়। তাই এ রোগ তিনটি নামে পরিচিত, যথা- পাতা ব্লাষ্ট, গিঁট ব্লাষ্ট ও শিষ ব্লাষ্ট। পাতা ব্লাষ্টে প্রথমে পাতায় ছোট ছোট ডিম্বাকৃতি দাগ হয়। আস্তে আস্তে দাগ বড় হয়ে দুপ্রান্ত লম্বা হয়ে চোখের আকৃতি ধারণ করে। দাগের চার ধারে গাঢ় বাদামি ও মাঝের অংশ সাদা-ছাই বর্ণ ধারণ করে। অনেকগুলো দাগ একত্রে মিশে গিয়ে পুরো পাতা মরে যায়। এ রোগের কারণে জমির সমস্ত ধান নষ্ট হয়ে যেতে পারে। বাংলাদেশে এ রোগ বোরো মৌসুমে বেশি হয়। গিঁট ব্লাষ্ট এবং শিষ ব্লাষ্ট হলে গিঁট ও শিষ ভেঙ্গে পড়ে এবং ধান চিটা হয়ে যায়।<br />রাতে ঠান্ডা, দিনে গরম ও সকালে পাতায় শিশির জমে থাকা পরিবেশে এ রোগ দ্রুত বিস্তার লাভ করে। বেলে জাতীয় মাটি এবং বেশি ইউরিয়া সার প্রয়োগ এ রোগ বৃদ্ধিতে সাহায্য করে। ব্যবস্থাপনার জন্য-<br />ক) জমিতে পানি ধরে রাখুন।<br />খ) রোগমুক্ত জমি থেকে বীজ সংগ্রহ করুন।<br />গ) সুষম মাত্রায় সার ব্যবহার করুন। আক্রান্ত জমিতে ইউরিয়া সারের উপরি-প্রয়োগ বন্ধ রাখুন।<br />ঘ) প্রতি হেক্টরে ৮০০ মিলিলিটার হিনোসান অথবা ২.৫ কেজি বেনলেট বা হোমাই অথবা টপসিন এম প্রয়োগ করুন।<br /><br />খোলপোড়া:<br />খোলপোড়া একটি ছত্রাকজনিত রোগ। ধান গাছের কুশি গজানোর সময় হতে রোগটি দেখা যায়। পানিতে ভাসমান ছক্রাক গুটিকা দিয়ে প্রাথমিক আক্রমণ সংঘটিত হয়। প্রথমে খোলে গোলাকার ও লম্বাটেধূসর রঙের জলছাপের মতো দাগ পড়ে এবং তা আস্তে আস্তে বড় হয়ে উপরের দিকে সমস্ত খোলে ও পাতায় ছড়িয়ে পড়ে। আক্র্রান্ত খোল দেখতে অনেকটা গোখরো সাপের চামড়ার দাগের মতো। গরম ও আদ্র আবহওয়ায় রোগটি বেশি হয়। তা ছাড়া বেশি মাত্রায় ইউরিয়া ব্যবহার ও ঘন করে চারা রোপন এ রোগের বিস্তারে সহায়তা করে। আমাদের দেশে আউশ ও আমন মৌসুমে এ রোগের প্রাদুর্ভাব বেশি হয়। ব্যবস্থাপনার জন্য-<br />ক) আক্রান্ত জমির পানি শুকিয়ে ৭-১০ দিন পর আবার সেচ দিন।<br />খ) সুষম মাত্রায় সার ব্যবহার করুন।<br />গ) যে সব এলাকায় প্রতি বছর এ রোগ হয় সেখানে খাটো গাছের জাতের পরিবর্তে মোটামুটি লম্বা জাতের ধান চাষ করুন।<br />ঘ) রোগাক্রান্ত জমির ফসল কাটার পর নাড়া পুড়িয়ে ফেলুন।<br />ঙ) জমিতে শেষ মই দেয়ার পর ময়লা আবর্জনা যেখানে যেখানে পানিতে ভাসতে দেখা যায় সেগুলো চট বা কাপড় দিয়ে টেনে আইলের উপর তুলে দিলে প্রায় ৫০% আক্রমণ কমানো সম্ভব।<br />চ) রোগের লক্ষণ দেখামাত্র ফলিকুর বা কয়ান্টাফ প্রয়োগ করুন।<br /> <br />বাকানি<br />এটি একটি ছত্রাকজনিত রোগ। এ ছত্রাক জিবেরিলিন হরমোন নিঃসরণ করে। এ হরমোনের কারণে আক্রান্ত ধানগাছ দ্রুত বেড়ে যায়। ফলে আক্রান্ত চারা বা কুশি লিকলিকে হয়ে যায়। ধীরে ধীরে আক্রান্ত গাছ মরে যায়। ব্যবস্থাপনার জন্য-<br />ক) আক্রান্ত গাছ তুলে ফেলা।<br />খ) সুস্থ গাছ থেকে কুশি আলাদা করে ঐ স্থানে রোপন করা ।<br />গ) এ রোগ বীজবাহিত। তাই বীজ শোধন করতে পারলে ভালো হয়। এ জন্য ব্যাভিষ্টিন/নোইন/হেডাজিম/টপসিল প্লাস/ সানফানেট নামক ছত্রকনাশকের যে কোন একটির তিন গ্রাম এক লিটার পানিতে মিশিয়ে এক কেজি বীজ সারা রাত ভিজিয়ে রাখলে শোধন হয়।', 'ব্রি এ পর্যন্ত ধানের ১৭৫ টি প্রজাতির ক্ষতিকর পোকা সনাক্ত করেছে।এদের মধ্যে ২০-৩৩ টি প্রজাতিকে ধানের প্রধান ক্ষতিকর পোকা হিসেবে গণ্য করা হয়। পোকার ক্ষতির মাত্রা পোকার প্রজাতি, পোকার সংখ্যা, এলাকার পরিবেশ, জমি বা তার আশেপাশের অবস্থা, ধানের জাত, ধানগাছের বয়স, উপকারী পরভোজী ও পরজীবি পোকামাকড়ের সংখ্যা ইত্যাদির উপর নির্ভরশীল। ধান ক্ষেতে ক্ষতিকর পোকা দেখা গেলে এর সাথে বন্ধু পোকা যেমন মাকড়সা, লেডি-বার্ড বিটল, ক্যারাবিড বিটল সহ অনেক পরভোজী ও পরজীবি পোকামাকড় কেমন আছে তা দেখতে হবে এবং শুধু প্রয়োজনে কীটনাশক প্রয়োগ করতে হবে। প্রধান প্রধান ক্ষতিকর পোকার আক্রমণ দমন করলে বোরো, আউশ এবং রোপা আমন মৌসুমে যথাক্রমে শতকরা ১৩, ২৪ এবং ১৮ ভাগ ফলন বেশি হতে পারে। প্রধান ক্ষতিকর পোকা ও তাদের দমন ব্যবস্থাপনা নিচে আলোচনা করা হলো।<br />মাজরা পোকা (Stem borer) <br />মাজরা পোকার কীড়া গাছের কুশি ও শিষের ক্ষতি করে। ফলে কুশি অবস্থায় আক্রমণ হলে মরা ডিগ ও ফুল আসার পর সাদাশিষ দৃষ্টি গোচর হয়। প্রায় সব অঞ্চলে সব ঋতুতেই এটি প্রধান ক্ষতিকারক পোকা হিসেবে পরিচিত। ব্যবস্থাপনার জন্য-<br />ক) আলোক ফাঁদের সাহায্যে মথ সংগ্রহ করে দমন করুন। <br />খ) মাজরা পোকার ডিমের গাদা সংগ্রহ করে নষ্ট করুন। <br />গ) ডালপালা পুঁতে পোকাখেকো পাখির সাহায্য নিন।<br />ঘ) রোপা আমন ধান কাটার পর ক্ষেতে চাষ দিয়ে নাড়াগুলো মাটিতে মিশিয়ে বা পুড়িয়ে ফেলুন অথবা জ্বালানি হিসেবে ব্যবহার করুন।<br />ঙ) পরজীবি পোকা শতকরা ৫০-৬০ ভাগ মাজরা পোকার ডিম নষ্ট করে থাকে, সুতরাং যথাসম্ভব কীটনাশক পরিহার করুন।<br />চ) জমিতে শতকরা ১০-১৫ ভাগ মরা ডিগ অথবা শতকরা ৫ ভাগ সাদা শিষ দেখা দিলে অনুমোদিত কীটনাশক প্রয়োগ করুন (সারণী ৯)।<br /><br />নলিমাছি বা গলমাছি (Gallmidge)<br />এ মাছির কীড়া ধানগাছের মাঝখানে বাড়ন্ত কুশিতে আক্রমণ করে। ফলে ঐ কুশি পেঁয়াজ পাতার মতো হয়ে যায়। এ অবস্থায় কুশিতে আর শিষ হয় না। রাজশাহী, দিনাজপুর ও রংপুর এলাকায় এ পোকার আক্রমণ দিন দিন বৃদ্ধি পাচ্ছে। ব্যবস্থাপনার জন্য-<br />ক) নিয়মিত জমি পর্যবেক্ষণ করুন।<br />খ) আলোক ফাঁদ ব্যবহার করে পূর্ণবয়স্ক পোকা দমন করুন।<br />গ) জমিতে শতকরা ৫ ভাগ পেঁয়াজ পাতার মতো লক্ষণ দেখা গেলে কীটনাশক ব্যবহার করুন (সারণী ৯)। এ ক্ষেত্রে দানাদার কীটনাশক তরল কীটনাশকের চেয়ে বেশি কার্যকর। <br /><br />পামরি পোকা (Rice hispa)<br />পূর্ণবয়স্ক পামরি পোকা ও কীড়া উভয়ই ধানগাছের ক্ষতি করে। পূর্ণৃবয়স্ক পোকা পাতার সবুজ অংশ কুরে কুরে খায়। কীড়া পাতার ভেতরে সুড়ংগ করে সবুজ অংশ খায়। এভাবে খাওয়ার ফলে পাতা সাদা দেখায়। ব্যবস্থাপনার জন্য-<br />ক) সম্মিলিতভাবে হাতজাল বা মশারির কাপড় দিয়ে পূর্ণবয়স্ক পোকা ধরে মেরে ফেলুন। সকাল বেলা পোকা ধরার উত্তম সময়। <br />খ) ধান ক্ষেতের বাইরে পামরি পোকা থাকলে সেখান থেকেও পোকা ধরে মারতে হবে। <br />গ) গাছের পাতায় ডিম বা ২-৩ টি কীড়া থাকলে এবং গাছ সর্বোচ্চ কুশি অবস্থার পূর্ব পর্যায়ে থাকলে পাতার গোড়ার ৩-৪ সেন্টিমিটার উপর থেকে কেটে নষ্ট করে পামরি পোকা দমন করা যায়।<br />ঘ) জমিতে শতকরা ৩৫ ভাগ পাতার ক্ষতি হলে অথবা প্রতি গোছায় ৪ টি পূর্ণবয়স্ক পোকা অথবা প্রতি কুশিতে ৫ টি কীড়া থাকলে কীটনাশক ব্যবহার করুন।<br /><br />পাতা মোড়ানো পোকা (Leaf roller)<br />পাতা মোড়ানো পোকার কীড়া গাছের পাতা লম্বালম্বিভাবে মুড়িয়ে পাতার ভিতরের সবুজ অংশ খায়। খুব বেশি ক্ষতি করলে পাতা পুড়ে যাওয়ার মতো দেখায়। ব্যবস্থাপনার জন্য-<br />ক) আলোক ফাঁদের সাহায্যে মথ সংগ্রহ করে দমন করুন। <br />খ) ক্ষেতে ডালপালা পুঁতে পোকাখেকো পাখির সাহায্য নিন।<br />গ) পরজীবি পোকা পাতামোড়ানো পোকার শতকরা ৩০-৪০ ভাগকীড়া ধ্বংশ করতে পারে, তাই পরজীবি পোকার সংরক্ষণ ও সংখ্যা বৃদ্ধির জন্য কীটনাশক ব্যবহার যথাসম্ভব পরিহার করুন।<br />ঘ) গাছে থোড় আসার সময় বা ঠিক তার আগে যদি শতকরা ২৫ ভাগ পাতা অত্যন্ত ক্ষতিগ্রস্থ হয় তবে অনুমোদিত কীটনাশক প্রয়োগ করুন (সারণী ৯)।<br /><br />চুঙ্গি পোকা (Rice caseworm)<br />চুঙ্গি পোকার কীড়া পাতার সবুজ অংশ এমনভাবে খায় যে শুধু পাতার উপরের পর্দাটা বাকী থাকে। কীড়া বড় হলে পাতার উপরের অংশ কেটে ছোট ছোট চুঙ্গি তৈরি করে ভেতরে থাকে। আক্রান্ত ক্ষেতে গাছের পাতা সাদা দেখায় এবং পাতার উপরের অংশ কাটা থাকে। দিনের বেলায় চুঙ্গিগুলো পানিতে ভাসতে থাকে। ব্যবস্থাপনার জন্য-<br />ক) আলোক ফাঁদের সাহায্যে মথ সংগ্রহ করে দমন করুন। <br />খ) পানি থেকে হাতজাল দিয়ে চুঙ্গিসহ কীড়া সংগ্রহ করে ধ্বংশ করুন।<br />গ) আক্রান্ত জমির পানি সরিয়ে দিন এবং মাটি শুকিয়ে নিন।<br />ঘ) জমিতে শতকরা ২৫ ভাগ পাতা ক্ষতিগ্রস্থ হলে অনুমোদিত কীটনাশক প্রয়োগ করুন (সারণী ৯)।<br /><br />লেদা পোকা (Swarming caterpillar)<br />এ পোকার কীড়া পাতার পাশ থেকে কেটে এমনভাবে খায় কেবল ধানগাছের কান্ড অবশিষ্ট থাকে। সাধারণত শুকনো জমিতে এ পোকার আক্রমণের আশংকা বেশি থাকে। কারণ এদের জীবণচক্রের পুত্তলী অবস্থার জন্য শুকনো জমির দরকার হয়। ব্যবস্থাপনার জন্য-<br />ক) রোপা আমন ধান কাটার পর ক্ষেতে চাষ দিয়ে নাড়াগুলো মাটিতে মিশিয়ে বা পুড়িয়ে ফেলুন অথবা জ্বালানি হিসেবে ব্যবহার করুন।<br />খ) আলোক ফাঁদের সাহায্যে মথ সংগ্রহ করে দমন করুন। <br />গ) ক্ষেতে ডালপালা পুঁতে পোকাখেকো পাখির সাহায্য নিন।<br />ঘ) সম্ভব হলে ২/১ দিনের জন্য ক্ষেতে ৫ সেন্টিমিটার পানি জমিয়ে রাখুন। এতে পুত্তলীগুলো মরে যাবে।<br />ঙ) জমিতে শতকরা ২৫ ভাগ পাতা- ক্ষতিগ্রস্থ হলে অনুমোদিত কীটনাশক প্রয়োগ করুন (সারণী ৯)।<br /><br />ঘাসফড়িং (Grasshoppers)<br />ঘাসফড়িং বাচ্চা ও পূর্ণবয়স্ক উভয় অবস্থায় ধানগাছের ক্ষতি করে। এরা ধানের পাতার পাশ থেকে শিরা পর্যন্ত খায়। জমিতে অধিক সংখ্যায় আক্রমণ করলে এদেরকে পঙ্গপাল বলা হয়। ব্যবস্থাপনার জন্য-<br />ক) ক্ষেতে ডালপালা পুঁতে পোকাখেকো পাখির সাহায্য নিন।<br />খ) জমিতে শতকরা ২৫ ভাগ পাতা ক্ষতিগ্রস্থ হলে অনুমোদিত কীটনাশক প্রয়োগ করুন (সারণী ৯)।<br /><br />লম্বাশুঁড় উরচুঙ্গা (Long-horned cricket)<br />পূর্ণবয়স্ক পোকা ও বাচ্চা উভয় অবস্থায় ধানের পাতা এমনভাবে খায় যে পাতার কিনারা ও শিরা শুধু বাকি থাকে। ক্ষতিগ্রস্থ পাতা ঝাঁঝরা হয়ে যায়। ব্যবস্থাপনার জন্য-<br />ক) ক্ষেতে ডালপালা পুঁতে পোকাখেকো পাখির সাহায্য নিন।<br />খ) আলোক ফাঁদের সাহায্যে পূর্ণবয়স্ক পোকা দমন করুন।<br />গ) জমিতে শতকরা ২৫ ভাগ পাতা ক্ষতিগ্রস্থ হলে অনুমোদিত কীটনাশক প্রয়োগ করুন (সারণী ৯)।<br /><br />সবুজ পাতা ফড়িং (Green leafhopper)<br />পূর্ণবয়স্ক পোকা ও বাচ্চা উভয় অবস্থায় সবুজ পাতা ফড়িং ধানের পাতার রস শুষে খায়। ফলে গাছের বৃদ্ধি কমে যায় ও গাছ খাটো হয়ে যায়। এ পোকা টুংরো ভাইরাস রোগ ছড়িয়ে সবচেয়ে বেশি ক্ষতি করে। ব্যবস্থাপনার জন্য-<br />ক) আলোক ফাঁদের সাহায্যে পূর্ণবয়স্ক পোকা দমন করুন।<br />খ) হাতজালের প্রতি টানে যদি গড়ে একটি সবুজ পতাফড়িং পাওয়া যায় এবং আশেপাশে টুংরো রোগাক্রান্ত ধানগাছ থাকে, তাহলে বীজতলায় বা জমিতে উপযুক্ত কীটনাশক প্রয়োগ করুন (সারণী ৯)।<br /><br />বাদামি গাছফড়িং (Brown planthopper)<br />পূর্ণবয়স্ক পোকা ও বাচ্চা উভয় অবস্থায় বদামি গাছফড়িং ধান গাছের গোড়ায় বসে রস শুষে খায়। ফলে গাছ নিস্তেজ হয়ে যায় এবং ফড়িংপোড়া বা বাজপোড়া (হপার বার্ন) অবস্থার সৃষ্টি করে। ব্যবস্থাপনার জন্য-<br />ক) নিয়মিতভাবে গাছের গোড়া পর্যবেক্ষণ করুন।<br />খ) জমিতে এ পোকার সংখ্যা বাড়ার আশংকা দেখা দিলে জমে থাকা পানি সরিয়ে জমি কয়েকদিন শুকিয়ে নিন।<br />গ) উপদ্রুত এলাকায় ধানের চারা ঘন করে না লাগিয়ে ২০ x ২৫ সেন্টিমিটার দূরে দূরে লাগান।<br />ঘ) অধিকাংশ গাছে ৪টি গর্ভবতী বা ১০টি বাচ্চা পোকা দেখা দিলে উপযুক্ত কীটনাশক প্রয়োগ করুন (সারণী ৯)। কীটনাশক অবশ্যই গাছের গোড়ায় প্রয়োগ করতে হবে।<br /><br />সাদা-পিঠ গাছফড়িং (White-backed planthopper)<br />পূর্ণবয়স্ক পোকা ও বাচ্চা উভয় অবস্থায় সাদা-পিঠ গাছফড়িং ধান গাছের গোড়ায় বসে রস শুষে খায়। সংখ্যা বেশী হলে গাছের উপরের অংশেও এদের দেখতে পাওয়া যায়। এ পোকার আক্রমণেও ক্ষেতে  ফড়িংপোড়া বা বাজপোড়া (হপার বার্ন) অবস্থার সৃষ্টি করে। ব্যবস্থাপনার জন্য বাদামি গাছফড়িংয়ের মতো একই ব্যবস্থা নিন।<br /><br />গান্ধি পোকা (Rice bug)<br />পূর্ণবয়স্ক পোকা ও বাচ্চা উভয় অবস্থায় ধানের দানা আক্রমণ করে। ধানের দানায় দুধ সৃষ্টির সময় আক্রমণ হলে ধান চিটা হয়। বাচ্চা ও পূর্ণবয়স্ক গান্ধি পোকার গা থেকে বিশ্রী গন্ধ বের হয়। ব্যবস্থাপনার জন্য-<br />ক) আলোক ফাঁদের সাহায্য নিন।<br />খ) প্রতি গোছায় ২-৩টি গান্ধি পোকা দেখা গেলে উপযুক্ত কীটনাশক প্রয়োগ করুন (সারণী ৯)। কীটনাশক বিকেল বেলায় প্রয়োগ করতে হবে।', 'অধিক পাকা অবস্থায় ফসল কাটলে অনেক ধান ঝরে পড়ে, শিষ ভেঙ্গে যায়, শিষকাটা লেদাপোকা এবং পাখির আক্রমণ হতে পারে। তাই শিষের অগ্রভাগের শতকরা ৮০ ভাগ ধানের চাল শক্ত ও স্বচ্ছ এবং শিষের নিচের অংশে শতকরা ২০ ভাগ ধানের চাল আংশিক শক্ত। স্বচ্ছ হলে ধান কাটার উপযুক্ত হয়েছে বুঝতে হবে। এ সময়ে ফষল কেটে মাঠেই বা উঠানে এনে মাড়াই করতে হবে। মাড়াই করার পর অন্তত ৪-৫ দিন রোদে শুকিয়ে ভালভাবে ঝেড়ে গোলাজাত করতে হবে।', 'বপনের জন্য রোগমুক্ত, পরিস্কার ও পরিপুষ্ট বীজ ব্যবহার নিশ্চিত করতে হবে। মানসম্পন্ন বীজ ব্যবহারের লক্ষ্যে ভালভাবে বীজ বাছাইয়ের জন্য নিম্নবর্ণিত পদ্ধতি অনুসরণ করতে হবে।<br />প্রায় ৪০ লিটার পরিস্কার পানিতে দেড় কেজি ইউরিয়া সার মিশিয়ে দিন। এবার ৪০ কেজি বীজ ছেড়ে হাত দিয়ে নেড়েচেড়ে দিন। ভারী, পুষ্ট, সুস্থ ও সবল বীজ ডুবে নিচে জমা হবে এবং অপরিপুষ্ট, হালকা, রোগা বা ভাঙ্গা বীজ ভেসে উঠবে। হাত অথবা চালনি দিয়ে ভাসমান বীজগুলো পৃথক করে নিন। ভারী বীজ নিচ থেকে তুলে নিয়ে পরিস্কার পানিতে ৩-৪ বার ভাল করে ধুয়ে নিতে হবে। ইউরিয়া মিশানো পানি সার হিসাবে বীজতলায় ব্যবহার করা যায়। কুলা দিয়ে ঝেড়ে বীজ বাছাই পদ্ধতি প্রচলিত আছে।  এতে চিটা দূর হলেও অপরিপুষ্ট বীজ দূরীভূত হয় না।<br /><br />সতেজ ও সবল চারা আমাদের প্রধান কাম্য। তাই বাছাইকৃত বীজ ওজন করে নিতে হবে। প্রতি বর্গমিটার বীজতলায় ৮০-১০০ গ্রাম বীজ বোনা দরকার। এরূপ ১ বর্গমিটার বীজতলার চারা দিয়ে ২৫-৩০ বর্গমিটার জমি রোপণ করা যাবে। উল্লেখ্য যে,ডাপোগ বীজতলার জন্য প্রতি বর্গমিটারে ২.৫-৩.০ কেজি বীজ বুনতে হবে এবং শুকনো বীজতলার জন্য বীজ জাগ দেওয়ার প্রয়োজন নেই। ভেজা বীজতলায় বীজ বেডের উপর থাকে বলে পাখিদের নজরে পড়ে। তাই বপনের সময় থেকে ৪/৫ দিন পর্যন্ত  পাহারা দিতে হবে। সারণী ২-এ জাত-ভিত্তিক বীজ বপনের সময় উল্লেখ করা হয়েছে।<br /><br />বীজতলা তৈরির আগে সারণী ২ দেখে জেনে নিতে হবে কখন কোন জাতের ধানের বীজ বীজতলায় বপন করতে হবে। চারটি পদ্ধতিতে বীজতলা তৈরি করা যায়। এগুলো হচ্ছে শুকনো, কাদাময়, ভাসমান ও ডাপোগ বীজতলা।<br /><br />শুকনো বীজতলা<br />উপযুক্ত আদ্রতায় ৫-৬ বার চাষ ও মই দিয়ে মাটিকে একেবারে ঝুরঝুরে করার পর জমি সমান করতে হবে। এবার এক মিটার চওড়া করে জমির দৈর্ঘ্য বরাবরে বেড তৈরি করতে হবে। বেডের পাশে পানি নিস্কাশনের জন্য ২৫-৩০ সেন্টিমিটার চওড়া নালা তৈরি করতে হবে। বেডের উপরিভাগের মাটি ভালোভাবে সমান করার পর শুকনো বীজ সমান ভাবে ছিটিয়ে দিন। এখন উপরের মাটি এমনভাবে নাড়াচাড়া করতে হবে যেন বীজগুলো ২.৫-৪.০ সেন্টিমিটার (১.০-১.৫ ইঞ্চি) মাটির নিচে চলে যায়। এ কাজকে সহজ করতে ধুলা-মাটির আস্তরণ দেওয়া যায়। বেডের মাটিতে প্রয়োজনীয় আদ্রতা নিশ্চিত করার জন্য নালা ভর্তি করে সেচ দেওয়া উচিত। <br /><br />কাদাময় বীজতলা<br />দোঁআশ ও এটেল মাটি এ বীজতলার জন্য ভাল। প্রতি বর্গমিটার জমিতে দুই কেজি হারে জৈব সার ছড়িয়ে দিতে হবে। এরপর জমিতে ৫-৬ সেন্টিমিটার পানি দিয়ে দু-তিনটি চাষ ও মই দিয়ে ৭ থেকে ১০ দিন রেখে দিন এবং পানি আটকিয়ে রাখুন। আগাছা, খড় ইত্যাদি পচে গেলে আবার চাষ ও মই দিয়ে থকথকে কাদাময় করে জমি তৈরি করতে হবে। এবার এক মিটার চওড়া করে জমির দৈর্ঘ বরাবরে বেড তৈরি করতে হবে। বেডের পাশে পানি নিস্কাশনের জন্য ২৫-৩০ সেন্টিমিটার চওড়া নালা তৈরি করতে হবে। বেডের উপরের মাটি বাঁশ বা কাঠের চ্যাপ্টা লাঠি দিয়ে সমান করতে হবে। কাদা বেশি হলে বীজ মাটিতে ডুবে যাবে এবং তাতে ভালভাবে বীজ গজাবে না। এ অবস্থায় বেড তৈরির ৩/৪ ঘন্টা পর বীজ বোনা দরকার। <br /><br />ভাসমান বীজতলা<br />বন্যা কবলিত এলাকায় যদি বীজতলা করার মতো উঁচু জায়গা না থাকে বা বন্যার পানি নেমে যাওয়ার পর চারা তৈরির প্রয়োজনীয় সময় না পাওয়া যায় তাহলে বন্যার পানি, পুকুর, ডোবা বা খালের পানির উপর বাঁশের চাটাইয়ের মাচা বা কলাগাছের ভেলা করে তার উপর ২-৩ সেন্টিমিটার পরিমাণ কাদার প্রলেপ দিয়ে ভেজা বীজতলার মত ভাসমান বীজতলা তৈরি করা যায়। বন্যার পানিতে যাতে ভেসে না যায় সেজন্য বীজতলা দড়ি বা তার দিয়ে খুঁটির সাথে বেঁধে রাখা দরকার। পানিতে ভাসমান থাকায় এ বীজতলায় পানি সেচের দরকার হয় না।<br /><br />ডাপোগ বীজতলা<br />বন্যা কবলিত এলাকার জন্য ডাপোগ বীজতলা করা যায়। বাড়ীর উঠান, পাকা বারান্দা বা যে কোন শুকনো জায়গায় চারিদিকে মাটি,কাঠ,ইট বা কলাগাছের বাকল দিয়ে চৌকোণা করে নিতে হবে। এবার কলাপাতা বা পলিথিন বিছিয়ে তার উপর ঘন করে অঙ্কুরিত বীজ বুনতে হবে। এ বীজতলার নীচে আচ্ছাদন থাকায় চারা মাটি থেকে কোনরূপ খাদ্য বা পানি পায় না বলে ৫-৬ ঘন্টা পরপর ভিজিয়ে দিতে হবে এবং দু’সপ্তাহের মধ্যেই চারা তুলে রোপন করতে হবে।  অন্যথায় চারা খাদ্যের অভাবে মারা যেতে পারে।<br /><br />বাছাইকৃত বীজ কাপড় বা চটের ব্যাগে ভরে ঢিলা করে বেঁধে পানিতে ডুবিয়ে রাখুন ২৪ ঘন্টা। এরপর বীজের পোটলা পানি থেকে তুলে ইট বা কাঠের উপর ঘন্টাকানেক রেখে দিন পানি ঝরার জন্য। এবার বাঁশের টুকরি বা ড্রামে ২/৩ পরত শুকনো খড় বিছিয়ে তার উপর বীজের পোটলা রাখুন এবং আবারও ৩/৪ পরত শুকনো খড় দিয়ে ভালোভাবে চেপে তার উপর ইট বা কাঠ অথবা যেকোন ভারি জিনিস দিয়ে চাপা দিন। এভাবে জাগ দিলে ৪৮ ঘন্টা বা ২ দিনেই ভালো বীজের অঙ্কুর বের হবে এবং কাদাময় বীজতলায় বপনের উপযুক্ত হবে।', 'অতি লোনা ও বেলে জমি ছাড়া আর সব রকম মাটিতেই ধানের চাষ করা যায়। তবে শুধুমাত্র বন্যামুক্ত এলাকাতেই খরিপ মৌসুমে উচ্চ ফলনশীল ধানের চাষ করা হয়। বোরো মৌসুমে যেখানে সেচের ব্যবস্থা আছে সেখানে উচ্চ ফলনশীল ধানের চাষ করা যায়।', 'চারা উঠানোঃ<br />চারা উঠানোর আগে বীজতলায় বেশি করে পানি দিতে হবে যাতে বেডের মাটি ভিজে একেবারে নরম হয়ে যায়। চারা উঠাতে এমন সাবধানতা নিতে হবে যেন চারাগাছের কাণ্ড মুচড়ে বা ভেঙ্গে না যায়। উঠানো চারার মাটি কাঠ বা হাতে আছাড় না দিয়ে আস্তে আস্তে পানিতে নাড়াচাড়া দিয়ে পরিষ্কার করে নিতে হবে। গবেষণায় দেখা গেছে, চারাগাছের শিকড়  ছিঁড়ে গেলেও রোপনের পর চারার বাড়-বাড়তির কোনরূপ অসুবিধা হয় না কিন্তু কান্ড মুচড়ে গেলে চারাগাছের বেশ ক্ষতি হয়। এজন্য চারা উঠানোর পর ঐ চারার পাতা দিয়ে বান্ডিল বাঁধাও উচিত নয়। শুকনো খড় ভিজিয়ে নিয়ে বান্ডিল বাঁধতে হবে।<br /><br />চারা বহন<br />বীজতলা থেকে রোপণ ক্ষেতে চারা বহন করার সময় পাতা ও কান্ড মোড়ানো রোধ করতে হবে। এজন্য ঝুড়ি বা টুকরিতে  সাজিয়ে চারা বহন করা উচিত। বস্তাবন্দী করে ধানের চারা বহন করা উচিত নয়।', '2014-05-20 01:09:03');

-- --------------------------------------------------------

--
-- Table structure for table `recent_news`
--

CREATE TABLE IF NOT EXISTS `recent_news` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `news_title` varchar(300) NOT NULL,
  `news_post` text NOT NULL,
  `new_date` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=4 ;

--
-- Dumping data for table `recent_news`
--

INSERT INTO `recent_news` (`id`, `news_title`, `news_post`, `new_date`) VALUES
(1, '"আউশ উৎপাদন বৃদ্ধির কর্ম পরিকল্পনা ও বোরো উৎপাদন ব্যবস্থাপনা’’ শীর্ষক কর্মশালা', '২৭ মার্চ/২০১৪ খ্রি : বিএআরসি মিলনায়তনে আউশ উৎপাদন বৃদ্ধির কর্মপরিকল্পনা ও বোরো উৎপাদন ব্যবস্থাপনা শীর্ষক কর্মশালা অনুষ্ঠিত হয়। কর্মশালায় প্রধান অতিথি হিসেবে উপস্থিত ছিলেন কৃষিমন্ত্রী মতিয়া চৌধুরী, এম,পি। <br>\r\n\r\nউক্ত কর্মশালায় সভাপতিত্ব করেন কৃষি সচিব ড. এস এম নাজমুল ইসলাম, বিশেষ অতিথি ছিলেন জনাব মো. জহির উদ্দিন আহমেদ, এনডিসি, চেয়ারম্যান, বিএডিসি। সম্মানিত অতিথি হিসেবে উপস্থিত ছিলেন ড. মো. কামাল উদ্দিন, নির্বাহী চেয়ারম্যান, বিএআরসি। অনুষ্ঠানে স্বাগত বক্তব্য ও আউশ উৎপাদন বৃদ্ধির  কলাকৌশল ও পরিকল্পনা উপস্থাপন করেন কৃষি সম্প্রসারণ অধিদপ্তরের মহাপরিচালক কৃষিবিদ মো. আবু হানিফ মিয়া। <br>\r\n\r\nকৃষিমন্ত্রী তাঁর বক্তব্যে বলেন, প্রাচীনকাল থেকেই প্রাকৃতিক উপায়ে আউশের চাষ করা হচ্ছে বলে এটি সহজাত উৎপাদিত দানাদার শস্য। কৃষি বিপ্লবের ফলে বোরো আবাদ বৃদ্ধি পেলেও আধুনিক যান্ত্রিকীকরণের মাধ্যমে আউশের আবাদী জমি ও উৎপাদন উভয়ই বাড়ানো সম্ভব। আউশ আবাদের ব্যাপক উপকারিতা বর্ণনা করে সরকার কর্তৃক গৃহীত আউশ প্রণোদনা কর্মসূচির সফল বাস্তবায়নের লক্ষ্যে কৃষিমন্ত্রী সকলকে নিরলসভাবে কাজ করার আহবান জানান। আগামীতে আউশ উৎপাদন বৃদ্ধিতে সর্বস্তরের সকলকে এগিয়ে আসার জন্য আহ্বান জানান। <br>\r\n\r\nকর্মশালায় কৃষি সংশ্লিষ্ট বিভিন্ন সরকারি ও বেসরকারি প্রতিষ্ঠানের কর্মকর্তা, গবেষণা প্রতিষ্ঠানের কৃষি বিজ্ঞানী এবং কৃষকগণ উপস্থিত ছিলেন। প্রেস বিজ্ঞপ্তি', '2014-05-28 03:09:16'),
(2, '''স্বাধীনতা পুরষ্কার ২০১৪’-এ ভূষিত হলো বাংলাদেশ কৃষি গবেষণা ইনস্টিটিউট', 'বাংলাদেশ সরকারের সর্বোচ্চ বেসামরিক সম্মাননা ‘স্বাধীনতা পুরষ্কার ২০১৪’-এ ভূষিত হয়েছে ৯ জন বিশিষ্ট ব্যক্তি ও একটি প্রতিষ্ঠান। প্রধানমন্ত্রী শেখ হাসিনা মঙ্গলবার ২৫ মার্চ ২০১৪ ওসমানী স্মৃতি মিলনায়তনে বিভিন্ন ক্ষেত্রে অসামান্য অবদানের জন্য নয়জন বিশিষ্ট ব্যক্তি ও বাংলাদেশ কৃষি গবেষণা ইনস্টিটিউটকে চলতি বছরের স্বাধীনতা পুরষ্কার প্রদান করেন। প্রতিষ্ঠান হিসেবে বাংলাদেশ কৃষি গবেষণা ইনস্টিটিউটকে কৃষি ক্ষেত্রে অসামান্য উদ্ভাবন ও গবেষণায় বিশেষ অবদানের জন্য এই  স্বাধীনতা পুরস্কার দেওয়া হয়। ২৬ শে মার্চ মহান স্বাধীনতা দিবসকে সামনে রেখে বিভিন্ন ক্ষেত্রে অবদানের জন্য এই পদক দেয়া হয়ে থাকে।', '2014-05-28 07:19:08'),
(3, 'বিএডিসি কর্তৃক উৎপাদিত সরিষা, র্সূযমুখী, মসুর, ছোলা, খেসারী, মটর ও ফেলন বীজের মূল্য নির্ধারণ', 'বাংলাদেশ কৃষি উন্নয়ন কর্পোরেশন(বিএডিসি) কর্তৃক ১৬র্মাচ ২০১৪ তারিখে অনুষ্ঠিত সভার সিদ্ধান্তক্রমে ২০১৩-১৪ উৎপাদন বছরে রবি মৌসুমে উৎপাদিত সরিষা, র্সূযমুখী, মসুর, ছোলা, খেসারী, মটর ও ফেলন বীজের মূল্য নতুনভাবে নির্ধারণ করা হয়।', '2014-05-28 07:11:02');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `user_id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(150) CHARACTER SET utf8 NOT NULL,
  `password` varchar(150) CHARACTER SET utf8 NOT NULL,
  `email_add` varchar(200) CHARACTER SET utf8 DEFAULT NULL,
  `joined` datetime NOT NULL,
  `type` varchar(10) CHARACTER SET utf8 NOT NULL,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=4 ;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`user_id`, `username`, `password`, `email_add`, `joined`, `type`) VALUES
(1, 'Ashif', '123456', NULL, '2014-05-28 02:58:18', 'admin'),
(2, 'Rocky', 'e10adc3949ba59abbe56e057f20f883e', 'rocky@gmail.com', '2014-05-28 05:38:52', 'user'),
(3, 'Maruf', 'e10adc3949ba59abbe56e057f20f883e', 'maruf@gmail.com', '2014-05-28 05:53:33', 'user');

--
-- Constraints for dumped tables
--

--
-- Constraints for table `crop_category`
--
ALTER TABLE `crop_category`
  ADD CONSTRAINT `crop_category_ibfk_1` FOREIGN KEY (`category_id`) REFERENCES `categories` (`category_id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
